Revit 2024 API
MEPSystemClassification Enumeration
 This enumeration is used to classify MEP connectors and systems and drives certain behavior for a particular system type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum MEPSystemClassification
Visual Basic
Public Enumeration MEPSystemClassification
Visual C++
public enum class MEPSystemClassification
Members
Member name | Description
UndefinedSystemClassification |  A system classification not yet defined
SupplyAir |  A supply air duct system
ReturnAir |  A return air duct system
ExhaustAir |  Obsolete classification not used anymore
OtherAir |  An user classified air duct system
DataCircuit |  An electrical data circuit
PowerCircuit |  An electrical circuit
SupplyHydronic |  A hydronic supply piping system
ReturnHydronic |  A hydronic return piping system
Telephone |  An electrical circuit classified as telephone
Security |  An electrical security circuit
FireAlarm |  An electrical fire alarm circuit
NurseCall |  An electrical circuit classified as nurse call
Controls |  An electrical circuit classified as controls
Communication |  An electrical circuit classified as communication
CondensateDrain |  Reserved for future use
Sanitary |  A sanitary piping system
Vent |  A piping ventilation system
Storm |  Reserved for future use
DomesticHotWater |  A hot water piping system
DomesticColdWater |  A cold water piping system
Recirculation |  Reserved for future use
OtherPipe |  An user classified piping system
FireProtectWet |  A wet fire protection system
FireProtectDry |  A dry fire protection system
FireProtectPreaction |  A preaction fire protection system
FireProtectOther |  A user defined fire protection system
SwitchTopology |  An electrical switch system
Fitting |  Reserved for application usage, used for UI filtering in Family Editor
Global |  Reserved for application usage, used for UI filtering in Family Editor
PowerBalanced |  Equivalent with PowerCircuit
PowerUnBalanced |  Equivalent with PowerCircuit
CableTrayConduit |  Indicates the default type for cable trays and conduits
See Also
Autodesk.Revit.DB Namespace